const QuestionsData = [
    {
        question:"ถ้ามีปลา 10 ตัว ว่ายอยู่ในอ่างน้ำ มีปลา 2 ตัวจมน้ำตาย จะเหลือปลาในอ่างกี่ตัว?",
        A:"8 ตัว",
        B:"5 ตัว",
        C:"0 ตัว",
        D:"10 ตัว",
        answer:"D",
        detail: "D (10 ตัว) : เพราะปลาไม่จมน้ำตาย มันอาศัยอยู่ในน้ำ"
    },
    {
        question:"ถ้าไม้บรรทัดยาว 12 นิ้ว แต่ใช้แค่ครึ่งหนึ่งของมัน มันยาวกี่นิ้ว?",
        A:" 6 นิ้ว",
        B:"12 นิ้ว",
        C:"8 นิ้ว",
        D:"ขึ้นอยู่กับว่าตัดอย่างไร",
        answer:"B", //()
        detail: "B (12 นิ้ว) : เพราะไม้บรรทัดยาวเท่าเดิม แม้จะใช้ครึ่งเดียว"
    },
    {
        question:"แม่ของแอนมีลูก 5 คน ชื่อว่า หนึ่ง สอง สาม สี่ และ...ใคร?",
        A:"ห้า",
        B:"หก",
        C:"แอน",
        D:"เจ็ด",
        answer:"C",
        detail: "C (แอน) : เพราะว่าถามถึงแม่ของ \"แอน\" "
    },
    {
        question:"ถ้าคุณมีถุงขนาดใหญ่ที่ใส่ได้แค่ 10 กิโลกรัม แล้วคุณใส่น้ำหนัก 2 กิโลกรัมลงไปในถุง 5 ครั้ง จะเหลือพื้นที่ในถุงเท่าไร?",
        A:"0 กิโลกรัม",
        B:"10 กิโลกรัม",
        C:"5 กิโลกรัม",
        D:"1 กิโลกรัม",
        answer:"A",
        detail: "A (0 กิโลกรัม): เพราะถุงใส่น้ำหนักครบ 10 กิโลกรัมแล้ว"
    }, 
    {
        question:"มีนกอยู่บนต้นไม้ 10 ตัว ถ้ายิงนก 1 ตัว นกที่เหลือจะอยู่บนต้นไม้กี่ตัว?",
        A:"9 ตัว",
        B:"0 ตัว",
        C:"1 ตัว",
        D:"10 ตัว",
        answer:"B", // ()
        detail: "B (0 ตัว)  : เพราะนกที่เหลือจะบินหนีเมื่อได้ยินเสียงปืน"
    }
]

export default QuestionsData
